{
  "architectures": [
    "Qwen3TSForCausalLM"
  ],
  "attention_bias": false,
  "attention_dropout": 0.0,
  "auto_map": {
    "AutoConfig": "configuration_qwen3_ts.Qwen3TSConfig",
    "AutoModel": "modeling_qwen3_ts.Qwen3TSForCausalLM",
    "AutoModelForCausalLM": "modeling_qwen3_ts.Qwen3TSForCausalLM",
    "AutoProcessor": "processing_qwen3_ts.Qwen3TSProcessor"
  },
  "bos_token_id": 151643,
  "eos_token_id": 151645,
  "head_dim": 128,
  "hidden_act": "silu",
  "hidden_size": 5120,
  "ignore_index": -100,
  "initializer_range": 0.02,
  "intermediate_size": 17408,
  "layer_types": [
    "full_attention",
    "full_attention",
    "full_attention",
    "full_attention",
    "full_attention",
    "full_attention",
    "full_attention",
    "full_attention",
    "full_attention",
    "full_attention",
    "full_attention",
    "full_attention",
    "full_attention",
    "full_attention",
    "full_attention",
    "full_attention",
    "full_attention",
    "full_attention",
    "full_attention",
    "full_attention",
    "full_attention",
    "full_attention",
    "full_attention",
    "full_attention",
    "full_attention",
    "full_attention",
    "full_attention",
    "full_attention",
    "full_attention",
    "full_attention",
    "full_attention",
    "full_attention",
    "full_attention",
    "full_attention",
    "full_attention",
    "full_attention",
    "full_attention",
    "full_attention",
    "full_attention",
    "full_attention"
  ],
  "max_position_embeddings": 40960,
  "max_window_layers": 40,
  "model_type": "qwen3",
  "num_attention_heads": 40,
  "num_hidden_layers": 40,
  "num_key_value_heads": 8,
  "pad_token_id": 151643,
  "rms_norm_eps": 1e-06,
  "rope_scaling": null,
  "rope_theta": 1000000,
  "sliding_window": null,
  "tie_word_embeddings": false,
  "torch_dtype": "float16",
  "transformers_version": "4.52.4",
  "ts": {
    "embedding_dim": 16,
    "hidden_size": 5120,
    "max_length": 32768,
    "max_sequence_length": 32768,
    "num_features": 2,
    "num_layers": 5,
    "patch_size": 8,
    "use_layer_norm": false,
    "use_position_embedding": true,
    "use_position_idx": false
  },
  "ts_token_end_index": 151670,
  "ts_token_start_index": 151669,
  "use_cache": false,
  "use_sliding_window": false,
  "vocab_size": 151936
}